In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name" : [ 'harry' , 'rohan', 'skillf'],
    "marks" : [ 34,35,53],
    "city": ['rampur', 'kolkata','delhi']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks     city
0   harry     34   rampur
1   rohan     35  kolkata
2  skillf     53    delhi

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_noIndex.csv', index= False)

In [7]:
df.head(2)

    name  marks     city
0  harry     34   rampur
1  rohan     35  kolkata

In [8]:
df.tail(2)

     name  marks     city
1   rohan     35  kolkata
2  skillf     53    delhi

In [9]:
df.describe()

           marks
count   3.000000
mean   40.666667
std    10.692677
min    34.000000
25%    34.500000
50%    35.000000
75%    44.000000
max    53.000000

In [59]:
df.iloc['marks'][0] = 50

TypeError: Cannot index by location index with a non-integer key

In [11]:
df

     name  marks     city
0   harry     50   rampur
1   rohan     35  kolkata
2  skillf     53    delhi

In [12]:
df.index =['first' , 'second', 'third']

In [13]:
df

          name  marks     city
first    harry     50   rampur
second   rohan     35  kolkata
third   skillf     53    delhi

In [14]:
ser = pd.Series(np.random.rand(34))

In [15]:
ser

0     0.834420
1     0.173449
2     0.841650
3     0.005379
4     0.105844
5     0.571082
6     0.971315
7     0.614368
8     0.119888
9     0.919617
10    0.486803
11    0.395625
12    0.171248
13    0.685633
14    0.613767
15    0.996301
16    0.015822
17    0.441369
18    0.940623
19    0.867364
20    0.930453
21    0.148439
22    0.641306
23    0.510502
24    0.184238
25    0.122838
26    0.213279
27    0.650573
28    0.882500
29    0.678439
30    0.665092
31    0.815664
32    0.675945
33    0.584985
dtype: float64

In [16]:
type(ser)

pandas.core.series.Series

In [17]:
newDf = pd.DataFrame(np.random.rand(5,5), index= np.arange(5))

In [18]:
newDf.head()

          0         1         2         3         4
0  0.308087  0.606568  0.909480  0.170577  0.240894
1  0.983792  0.968246  0.900526  0.408441  0.149599
2  0.640531  0.266799  0.831332  0.387065  0.955513
3  0.761157  0.839330  0.718445  0.479643  0.185198
4  0.226017  0.307325  0.923233  0.155471  0.825178

In [19]:
type(newDf)

pandas.core.frame.DataFrame

In [20]:
newDf.describe()

              0         1         2         3         4
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.583917  0.597654  0.856603  0.320239  0.471276
std    0.315711  0.312082  0.084987  0.147650  0.386692
min    0.226017  0.266799  0.718445  0.155471  0.149599
25%    0.308087  0.307325  0.831332  0.170577  0.185198
50%    0.640531  0.606568  0.900526  0.387065  0.240894
75%    0.761157  0.839330  0.909480  0.408441  0.825178
max    0.983792  0.968246  0.923233  0.479643  0.955513

In [21]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [64]:
newDf[0][0] = 'ayush'

C:\Users\AYUSH\AppData\Local\Temp\ipykernel_33908\2880364529.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newDf[0][0] = 'ayush'

In [65]:
newDf

          0         1         2         3         4
0     ayush  0.968246  0.900526  0.408441  0.149599
1  0.640531  0.266799  0.831332  0.387065  0.955513
2  0.226017  0.307325  0.923233  0.155471  0.825178

In [24]:
newDf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [25]:
newDf.index

Index([0, 1, 2, 3, 4], dtype='int32')

In [26]:
newDf.columns

RangeIndex(start=0, stop=5, step=1)

In [27]:
newDf.to_numpy()

array([['ayush', 0.6065676017427232, 0.9094797708564213,
        0.17057680771452388, 0.24089367316836052],
       [0.9837922361493616, 0.9682462249434901, 0.9005257078791578,
        0.4084408987275485, 0.1495994402883185],
       [0.6405307665848918, 0.2667986562392525, 0.831331996810929,
        0.387065187975015, 0.9555132216845051],
       [0.7611570123137141, 0.8393304140002525, 0.7184448932397219,
        0.4796430196783843, 0.1851984225133444],
       [0.22601679542114805, 0.30732496142648946, 0.9232327789631737,
        0.155470537456748, 0.8251776258259014]], dtype=object)

In [28]:
newDf[0][0] = 0.67

In [29]:
newDf

          0         1         2         3         4
0      0.67  0.606568  0.909480  0.170577  0.240894
1  0.983792  0.968246  0.900526  0.408441  0.149599
2  0.640531  0.266799  0.831332  0.387065  0.955513
3  0.761157  0.839330  0.718445  0.479643  0.185198
4  0.226017  0.307325  0.923233  0.155471  0.825178

In [30]:
newDf.T

          0         1         2         3         4
0      0.67  0.983792  0.640531  0.761157  0.226017
1  0.606568  0.968246  0.266799   0.83933  0.307325
2   0.90948  0.900526  0.831332  0.718445  0.923233
3  0.170577  0.408441  0.387065  0.479643  0.155471
4  0.240894  0.149599  0.955513  0.185198  0.825178

In [31]:
newDf.sort_index(axis=1 , ascending=False)

          4         3         2         1         0
0  0.240894  0.170577  0.909480  0.606568      0.67
1  0.149599  0.408441  0.900526  0.968246  0.983792
2  0.955513  0.387065  0.831332  0.266799  0.640531
3  0.185198  0.479643  0.718445  0.839330  0.761157
4  0.825178  0.155471  0.923233  0.307325  0.226017

In [32]:
newDf2 = newDf.copy()

In [33]:
newDf2[0][0] = 34323

C:\Users\AYUSH\AppData\Local\Temp\ipykernel_33908\4022505043.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newDf2[0][0] = 34323

In [34]:
newDf

          0         1         2         3         4
0      0.67  0.606568  0.909480  0.170577  0.240894
1  0.983792  0.968246  0.900526  0.408441  0.149599
2  0.640531  0.266799  0.831332  0.387065  0.955513
3  0.761157  0.839330  0.718445  0.479643  0.185198
4  0.226017  0.307325  0.923233  0.155471  0.825178

In [35]:
newDf.loc[0,0] = 245

In [36]:
newDf

          0         1         2         3         4
0       245  0.606568  0.909480  0.170577  0.240894
1  0.983792  0.968246  0.900526  0.408441  0.149599
2  0.640531  0.266799  0.831332  0.387065  0.955513
3  0.761157  0.839330  0.718445  0.479643  0.185198
4  0.226017  0.307325  0.923233  0.155471  0.825178

In [37]:
newDf.drop(4,axis=1)

          0         1         2         3
0       245  0.606568  0.909480  0.170577
1  0.983792  0.968246  0.900526  0.408441
2  0.640531  0.266799  0.831332  0.387065
3  0.761157  0.839330  0.718445  0.479643
4  0.226017  0.307325  0.923233  0.155471

In [38]:
newDf.loc[[0,1], [3,4]]

          3         4
0  0.170577  0.240894
1  0.408441  0.149599

In [39]:
newDf.loc[:,[1,2]]

          1         2
0  0.606568  0.909480
1  0.968246  0.900526
2  0.266799  0.831332
3  0.839330  0.718445
4  0.307325  0.923233

In [40]:
newDf.loc[(newDf[0]<0.5) & (newDf[2]>0.3)]

          0         1         2         3         4
4  0.226017  0.307325  0.923233  0.155471  0.825178

In [41]:
newDf.iloc[0,3]

0.17057680771452388

In [42]:
newDf.iloc[[0,2],[3,4]]

          3         4
0  0.170577  0.240894
2  0.387065  0.955513

In [43]:
newDf.drop([0,3] , axis = 0 , inplace = True)

In [44]:
newDf

          0         1         2         3         4
1  0.983792  0.968246  0.900526  0.408441  0.149599
2  0.640531  0.266799  0.831332  0.387065  0.955513
4  0.226017  0.307325  0.923233  0.155471  0.825178

In [45]:
newDf.reset_index(drop = True,inplace = True)

In [46]:
newDf

          0         1         2         3         4
0  0.983792  0.968246  0.900526  0.408441  0.149599
1  0.640531  0.266799  0.831332  0.387065  0.955513
2  0.226017  0.307325  0.923233  0.155471  0.825178

In [47]:
df = pd.DataFrame(np.array([['', 2, 3], [np.nan, 5, 6], [7, None, 9]]),
                   columns=['a', 'b', 'c'])

In [48]:
df

     a     b  c
0          2  3
1  NaN     5  6
2    7  None  9

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      object
 1   b       2 non-null      object
 2   c       3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

In [50]:
df

     a     b  c
0          2  3
1  NaN     5  6
2    7  None  9

In [51]:
df['a'].value_counts(dropna=True)

a
     1
7    1
Name: count, dtype: int64

In [52]:
df.isnull()

       a      b      c
0  False  False  False
1   True  False  False
2  False   True  False

In [53]:
df2 = pd.DataFrame(
    { 
        1 : [ 2 ,3 ,5 ] ,
        2 : [ 3 ,3 , 7] })

In [54]:
df2

   1  2
0  2  3
1  3  3
2  5  7

In [55]:
df.describe()

        a  b  c
count   2  2  3
unique  2  2  3
top        2  3
freq    1  1  1

In [56]:
df.count()

a    2
b    2
c    3
dtype: int64

In [57]:
df[1].mean()

KeyError: 1